[Killed] StringLiteral
src/index.js:7:34
   'https://generativelanguage.googleapis.com/v1beta/models/gemini-flash-latest:generateContent';
 
 const CORS_HEADERS = {
-  'Access-Control-Allow-Origin': '*',
+  'Access-Control-Allow-Origin': "",
   'Access-Control-Allow-Methods': 'POST',
   'Access-Control-Allow-Headers': 'Content-Type',
killedBy: [DIR] CORS preflight OPTIONS returns 200 with CORS headers
statusReason: expected '' to be '*' // Object.is equality

[Killed] BlockStatement
src/index.js:14:39
 
 export default {
   async fetch(request, env) {
-    if (request.method === 'OPTIONS') {
-      return new Response(null, { headers: CORS_HEADERS });
-    }
+    if (request.method === 'OPTIONS') {}
 
     if (request.method !== 'POST') {
killedBy: [DIR] CORS preflight OPTIONS returns 200 with CORS headers
statusReason: expected 405 to be 200 // Object.is equality

[Killed] EqualityOperator
src/index.js:14:9
 
 export default {
   async fetch(request, env) {
-    if (request.method === 'OPTIONS') {
+    if (request.method !== 'OPTIONS') {
       return new Response(null, { headers: CORS_HEADERS });
     }
killedBy: [DIR] CORS preflight OPTIONS returns 200 with CORS headers
statusReason: expected 405 to be 200 // Object.is equality

[Killed] BlockStatement
src/index.js:18:36
       return new Response(null, { headers: CORS_HEADERS });
     }
 
-    if (request.method !== 'POST') {
-      return new Response('Method not allowed', { status: 405 });
-    }
+    if (request.method !== 'POST') {}
 
     const startMs = Date.now();
killedBy: [BVA] Method guard GET returns 405 with body
statusReason: Unexpected end of JSON input

[Killed] ConditionalExpression
src/index.js:18:9
       return new Response(null, { headers: CORS_HEADERS });
     }
 
-    if (request.method !== 'POST') {
+    if (false) {
       return new Response('Method not allowed', { status: 405 });
     }
killedBy: [BVA] Method guard GET returns 405 with body
statusReason: Unexpected end of JSON input

[Killed] StringLiteral
src/index.js:25:44
     const startMs = Date.now();
     const { task, text, image, mealType } = await request.json();
 
-    const authHeader = request.headers.get('Authorization');
+    const authHeader = request.headers.get("");
     const isPaidRequest = env.TEST_AUTH_TOKEN && authHeader === `Bearer ${env.TEST_AUTH_TOKEN}`;
     const apiKey = isPaidRequest ? env.GEMINI_API_KEY_PAID : env.GEMINI_API_KEY;
killedBy: [BVA] Method guard POST is allowed (does not return 405)
statusReason: Headers.get: "" is an invalid header name.

[Killed] EqualityOperator
src/index.js:26:50
     const { task, text, image, mealType } = await request.json();
 
     const authHeader = request.headers.get('Authorization');
-    const isPaidRequest = env.TEST_AUTH_TOKEN && authHeader === `Bearer ${env.TEST_AUTH_TOKEN}`;
+    const isPaidRequest = env.TEST_AUTH_TOKEN && authHeader !== `Bearer ${env.TEST_AUTH_TOKEN}`;
     const apiKey = isPaidRequest ? env.GEMINI_API_KEY_PAID : env.GEMINI_API_KEY;
 
killedBy: [DIR] API key selection no auth header uses free key
statusReason: expected 'paid-key' to be 'free-key' // Object.is equality

[Killed] ConditionalExpression
src/index.js:26:27
     const { task, text, image, mealType } = await request.json();
 
     const authHeader = request.headers.get('Authorization');
-    const isPaidRequest = env.TEST_AUTH_TOKEN && authHeader === `Bearer ${env.TEST_AUTH_TOKEN}`;
+    const isPaidRequest = false;
     const apiKey = isPaidRequest ? env.GEMINI_API_KEY_PAID : env.GEMINI_API_KEY;
 
killedBy: [DIR] API key selection valid bearer token uses paid key
statusReason: expected 'free-key' to be 'paid-key' // Object.is equality

[Killed] BlockStatement
src/index.js:33:23
 
     const promptEntry = prompts[task];
-    if (!promptEntry) {
-      // Stryker disable next-line all
-      console.log(JSON.stringify({ event: 'err', ts: new Date().toISOString(), task, reason: 'unknown_task', durationMs: Date.now() - startMs }));
-      return new Response(JSON.stringify({ error: `Unknown task: ${task}` }), {
-        status: 400,
-        headers: { 'Content-Type': 'application/json' },
-      });
-    }
+    if (!promptEntry) {}
 
     const parts = [];
killedBy: [BVA] Unknown task guard unknown task returns 400
statusReason: Cannot read properties of undefined (reading 'systemPrompt')

[Killed] BooleanLiteral
src/index.js:33:9
 
     const promptEntry = prompts[task];
-    if (!promptEntry) {
+    if (promptEntry) {
       // Stryker disable next-line all
       console.log(JSON.stringify({ event: 'err', ts: new Date().toISOString(), task, reason: 'unknown_task', durationMs: Date.now() - startMs }));
killedBy: [BVA] Unknown task guard unknown task returns 400
statusReason: Cannot read properties of undefined (reading 'systemPrompt')

[Killed] ArrayDeclaration
src/index.js:42:19
       });
     }
 
-    const parts = [];
+    const parts = ["Stryker was here"];
     if (image) parts.push({ inlineData: { data: image.data, mimeType: image.mimeType ?? 'image/jpeg' } });
     const userText = [mealType ? `Meal type: ${mealType}` : null, text].filter(Boolean).join('\n');
killedBy: [BVA] No-input guard no text and no image returns 400
statusReason: expected '{\n  "error": {\n    "code": 400,\n  …' to match /text or image/i

[Killed] LogicalOperator
src/index.js:43:71
     }
 
     const parts = [];
-    if (image) parts.push({ inlineData: { data: image.data, mimeType: image.mimeType ?? 'image/jpeg' } });
+    if (image) parts.push({ inlineData: { data: image.data, mimeType: image.mimeType && 'image/jpeg' } });
     const userText = [mealType ? `Meal type: ${mealType}` : null, text].filter(Boolean).join('\n');
     if (userText) parts.push({ text: userText });
killedBy: [DIR] Image part construction image added as first part with inlineData
statusReason: expected { inlineData: { …(2) } } to deeply equal { inlineData: { …(2) } }

[Killed] ConditionalExpression
src/index.js:43:9
     }
 
     const parts = [];
-    if (image) parts.push({ inlineData: { data: image.data, mimeType: image.mimeType ?? 'image/jpeg' } });
+    if (true) parts.push({ inlineData: { data: image.data, mimeType: image.mimeType ?? 'image/jpeg' } });
     const userText = [mealType ? `Meal type: ${mealType}` : null, text].filter(Boolean).join('\n');
     if (userText) parts.push({ text: userText });
killedBy: [BVA] Method guard POST is allowed (does not return 405)
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] MethodExpression
src/index.js:44:22
 
     const parts = [];
     if (image) parts.push({ inlineData: { data: image.data, mimeType: image.mimeType ?? 'image/jpeg' } });
-    const userText = [mealType ? `Meal type: ${mealType}` : null, text].filter(Boolean).join('\n');
+    const userText = [mealType ? `Meal type: ${mealType}` : null, text].join('\n');
     if (userText) parts.push({ text: userText });
 
killedBy: [BVA] No-input guard no text and no image returns 400
statusReason: expected '{\n  "error": {\n    "code": 400,\n  …' to match /text or image/i

[Killed] ConditionalExpression
src/index.js:45:9
     const parts = [];
     if (image) parts.push({ inlineData: { data: image.data, mimeType: image.mimeType ?? 'image/jpeg' } });
     const userText = [mealType ? `Meal type: ${mealType}` : null, text].filter(Boolean).join('\n');
-    if (userText) parts.push({ text: userText });
+    if (true) parts.push({ text: userText });
 
     if (parts.length === 0) {
killedBy: [BVA] No-input guard no text and no image returns 400
statusReason: expected '{\n  "error": {\n    "code": 400,\n  …' to match /text or image/i

[Killed] ConditionalExpression
src/index.js:45:9
     const parts = [];
     if (image) parts.push({ inlineData: { data: image.data, mimeType: image.mimeType ?? 'image/jpeg' } });
     const userText = [mealType ? `Meal type: ${mealType}` : null, text].filter(Boolean).join('\n');
-    if (userText) parts.push({ text: userText });
+    if (false) parts.push({ text: userText });
 
     if (parts.length === 0) {
killedBy: [BVA] Unknown task guard known task parse_meal does not return 400 for unknown-task reason
statusReason: expected 400 not to be 400 // Object.is equality

[Killed] BlockStatement
src/index.js:47:29
     const userText = [mealType ? `Meal type: ${mealType}` : null, text].filter(Boolean).join('\n');
     if (userText) parts.push({ text: userText });
 
-    if (parts.length === 0) {
-      // Stryker disable next-line all
-      console.log(JSON.stringify({ event: 'err', ts: new Date().toISOString(), task, reason: 'no_input', durationMs: Date.now() - startMs }));
-      return new Response(JSON.stringify({ error: 'Provide text or image' }), {
-        status: 400,
-        headers: { 'Content-Type': 'application/json' },
-      });
-    }
+    if (parts.length === 0) {}
 
     const res = await fetch(GEMINI_URL, {
killedBy: [BVA] No-input guard no text and no image returns 400
statusReason: expected '{\n  "error": {\n    "code": 400,\n  …' to match /text or image/i

[Killed] ObjectLiteral
src/index.js:56:41
       });
     }
 
-    const res = await fetch(GEMINI_URL, {
-      method: 'POST',
-      headers: {
-        'Content-Type': 'application/json',
-        'x-goog-api-key': apiKey,
-      },
-      body: JSON.stringify({
-        system_instruction: { parts: [{ text: promptEntry.systemPrompt }] },
-        contents: [{ parts }],
-      }),
-    });
+    const res = await fetch(GEMINI_URL, {});
 
     if (!res.ok) {
killedBy: [DIR] API key selection no auth header uses free key
statusReason: Cannot read properties of undefined (reading 'x-goog-api-key')

[Killed] ObjectLiteral
src/index.js:58:16
 
     const res = await fetch(GEMINI_URL, {
       method: 'POST',
-      headers: {
-        'Content-Type': 'application/json',
-        'x-goog-api-key': apiKey,
-      },
+      headers: {},
       body: JSON.stringify({
         system_instruction: { parts: [{ text: promptEntry.systemPrompt }] },
killedBy: [DIR] API key selection no auth header uses free key
statusReason: expected undefined to be 'free-key' // Object.is equality

[Killed] ObjectLiteral
src/index.js:63:29
         'x-goog-api-key': apiKey,
       },
       body: JSON.stringify({
-        system_instruction: { parts: [{ text: promptEntry.systemPrompt }] },
+        system_instruction: {},
         contents: [{ parts }],
       }),
killedBy: [INV] System prompt forwarding parse_meal system prompt sent to Gemini
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
src/index.js:63:38
         'x-goog-api-key': apiKey,
       },
       body: JSON.stringify({
-        system_instruction: { parts: [{ text: promptEntry.systemPrompt }] },
+        system_instruction: { parts: [] },
         contents: [{ parts }],
       }),
killedBy: [INV] System prompt forwarding parse_meal system prompt sent to Gemini
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] OptionalChaining
src/index.js:79:21
     }
 
     const data = await res.json();
-    const rawText = data.candidates?.[0]?.content?.parts?.[0]?.text ?? '';
+    const rawText = data.candidates?.[0]?.content.parts?.[0]?.text ?? '';
     const cleaned = rawText.replace(/```json\s*/g, '').replace(/\s*```/g, '').trim();
 
killedBy: [BVA] Optional-chaining fallback candidate with no content → empty response body
statusReason: Cannot read properties of undefined (reading 'parts')

[Killed] OptionalChaining
src/index.js:79:21
     }
 
     const data = await res.json();
-    const rawText = data.candidates?.[0]?.content?.parts?.[0]?.text ?? '';
+    const rawText = data.candidates[0]?.content?.parts?.[0]?.text ?? '';
     const cleaned = rawText.replace(/```json\s*/g, '').replace(/\s*```/g, '').trim();
 
killedBy: [BVA] Optional-chaining fallback missing candidates key → empty response body
statusReason: Cannot read properties of undefined (reading '0')

[Killed] MethodExpression
src/index.js:80:21
 
     const data = await res.json();
     const rawText = data.candidates?.[0]?.content?.parts?.[0]?.text ?? '';
-    const cleaned = rawText.replace(/```json\s*/g, '').replace(/\s*```/g, '').trim();
+    const cleaned = rawText.replace(/```json\s*/g, '').replace(/\s*```/g, '');
 
     // Stryker disable next-line all
killedBy: [EQUIV] Markdown fence stripping strips bare ``` fences
statusReason: expected '\n{"title":"test"}' to be '{"title":"test"}' // Object.is equality

[Killed] StringLiteral
src/index.js:80:75
 
     const data = await res.json();
     const rawText = data.candidates?.[0]?.content?.parts?.[0]?.text ?? '';
-    const cleaned = rawText.replace(/```json\s*/g, '').replace(/\s*```/g, '').trim();
+    const cleaned = rawText.replace(/```json\s*/g, '').replace(/\s*```/g, "Stryker was here!").trim();
 
     // Stryker disable next-line all
killedBy: [EQUIV] Markdown fence stripping strips ```json and ``` from Gemini response
statusReason: expected '{"title":"test"}Stryker was here!' to be '{"title":"test"}' // Object.is equality

[Killed] ObjectLiteral
src/index.js:85:34
     // Stryker disable next-line all
     console.log(JSON.stringify({ event: 'res', ts: new Date().toISOString(), task, outputLen: cleaned.length, durationMs: Date.now() - startMs }));
 
-    return new Response(cleaned, {
-      headers: { 'Content-Type': 'application/json', ...CORS_HEADERS },
-    });
+    return new Response(cleaned, {});
   },
 };
killedBy: [DIR] Happy path response includes CORS header on success
statusReason: expected null to be '*' // Object.is equality

[Killed] StringLiteral
src/index.js:86:34
     console.log(JSON.stringify({ event: 'res', ts: new Date().toISOString(), task, outputLen: cleaned.length, durationMs: Date.now() - startMs }));
 
     return new Response(cleaned, {
-      headers: { 'Content-Type': 'application/json', ...CORS_HEADERS },
+      headers: { 'Content-Type': "", ...CORS_HEADERS },
     });
   },
killedBy: [DIR] Happy path content-type is application/json on success
statusReason: expected '' to contain 'application/json'
